Alright, here is a minimal code just in case:
```hcl
terraform {
  required_providers {
    harbor = {
      source  = "goharbor/harbor"
      version = "= 3.10.16"
    }
  }
}

variable "harbor_url" {
  type = string
}

variable "harbor_username" {
  type = string
}

variable "harbor_password" {
  type      = string
  sensitive = true
}

variable "harbor_project" {
  type = string
}

provider "harbor" {
  url      = var.harbor_url
  username = var.harbor_username
  password = var.harbor_password
}

resource "harbor_robot_account" "robot" {
  level       = "project"
  name        = "robot-pull"
  description = "Robot account for pulling artifacts"
  permissions {
    kind      = "project"
    namespace = var.harbor_project
    access {
      action   = "pull"
      resource = "repository"
    }
  }
}
```

After the second apply, it starts a force replacement loop:
```
harbor_robot_account.robot: Refreshing state... [id=/robots/2316]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # harbor_robot_account.robot must be replaced
-/+ resource "harbor_robot_account" "robot" {
      ~ full_name   = "robot+project_name+robot-pull" -> (known after apply)
      ~ id          = "/robots/2316" -> (known after apply)
      ~ name        = "project_name" -> "robot-pull" # forces replacement
      ~ robot_id    = "2316" -> (known after apply)
      ~ secret      = (sensitive value)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value:
```